DEFAULT_REPLY = """
Привет! Я - бот книжного клуба.
К сожалению, я ещё слишком маленький и нахожусь в разработке, поэтому не смогу тебе составить полноценную компанию.
Когда я буду готов, мои создатели обязательно оповестят тебя об этом сообщением в группе книжного клуба.
Кстати, в этой группе ты можешь делиться прочитанными книгами, выполнять задания и следить за откликами других участников.

Надеюсь, что мы скоро подружимся! Хорошего дня :)
"""

REPLY_WITH_NAME = """
Привет, %s! Я - бот книжного клуба.
К сожалению, я ещё слишком маленький и нахожусь в разработке, поэтому не смогу тебе составить полноценную компанию.
Когда я буду готов, мои создатели обязательно оповестят тебя об этом сообщением в группе книжного клуба.
Кстати, в этой группе ты можешь делиться прочитанными книгами, выполнять задания и следить за откликами других участников.

Надеюсь, что мы скоро подружимся! Хорошего дня :)
"""

START_GREETING = """
Привет! Я бот книжного клуба. Хочешь стать его частью? Тогда нажимай на кнопку ниже!
"""

DEFAULT_MESSAGE = """
Сообщение-заглушка
"""

REGISTERED_ERLIER = """
Вы уже были зарегистрированы ранее
"""

REGISTERED_T = """
Вы зарегистрированы под id %s
"""

#=========================================================== button lables
JOIN_CLUB_LABEL = "Вступить в клуб"
ADD_FEEDBACK_LABEL = "Написать отзыв"
VIEW_FEEDBACKS_LABEL = "Мои отзывы"

#=========================================================== cron messages
NOTIFY_NOW = """
Саша @alwaysfeelsun, сегодня нужно сделать еженедельный пост в группе!
"""

NOTIFY_SOON = """
Саша @alwaysfeelsun, завтра нужно будет сделать еженедельный пост в группе!
"""

TEST_MESSAGE = """
Это тестовое сообщение. Привет тестировщикам!
"""
