DEFAULT_REPLY = """
Привет! Я - бот книжного клуба.
К сожалению, я ещё слишком маленький и нахожусь в разработке, поэтому не смогу тебе составить полноценную компанию.
Когда я буду готов, мои создатели обязательно оповестят тебя об этом сообщением в группе книжного клуба.
Кстати, в этой группе ты можешь делиться прочитанными книгами, выполнять задания и следить за откликами других участников.

Надеюсь, что мы скоро подружимся! Хорошего дня :)
"""

REPLY_WITH_NAME = """
Привет, %s! Я - бот книжного клуба.
К сожалению, я ещё слишком маленький и нахожусь в разработке, поэтому не смогу тебе составить полноценную компанию.
Когда я буду готов, мои создатели обязательно оповестят тебя об этом сообщением в группе книжного клуба.
Кстати, в этой группе ты можешь делиться прочитанными книгами, выполнять задания и следить за откликами других участников.

Надеюсь, что мы скоро подружимся! Хорошего дня :)
"""

START_GREETING = """
Привет! Я бот книжного клуба. Хочешь стать его частью? Тогда нажимай на кнопку ниже!
"""

DEFAULT_MESSAGE = """
Сообщение-заглушка
"""

REGISTERED_ERLIER = """
Вы уже были зарегистрированы ранее
"""

REGISTERED_T = """
Вы зарегистрированы под id %s
"""

WRITE_YOUR_FEEDBACK = """
Напишите отзыв о книге в одно сообщение.
Не забудьте указать название и автора книги, а вот тег "отзывокниге" указывать не нужно.
"""

FEEDBACK_REGISTERED = """
Спасибо за отзыв, я его сохранил!
"""

NAS_NO_FEEDBACKS = """
У Вас пока нет отзывов.
Самое время рассказать о своих любимых книгах!
"""

EDIT_FEEDBACK_HINT = """
Напишите новый отзыв в одно сообщение и он полностью заменит старый.
Не забудьте указать название и автора книги, а вот тег "отзывокниге" указывать не нужно.
"""

FEEDBACK_UPDATED = """
Отзыв обновлён!
"""


INCORRECT_FB_NUMBER = """
Такого отзыва нет или Вы ввели не число.
Введите номер отзыва из сообщения без точки, чтобы посмотреть его полностью или перейти к редактиованию.
"""

#=========================================================== button lables
JOIN_CLUB_LABEL = "Вступить в клуб"
ADD_FEEDBACK_LABEL = "Написать отзыв"
VIEW_FEEDBACKS_LABEL = "Мои отзывы"
BACK_LABEL = "Назад"
TO_MENU_LABEL = "В меню"
FIRST_PAGE_FB_LABEL = "В начало"
PREV_PAGE_FB_LABEL = "Предыдущая"
NEXT_PAGE_FB_LABEL = "Следующая"
LAST_PAGE_FB_LABEL = "В конец"
EDIT_FEEDBACK_LABEL = "Редактировать отзыв"


#=========================================================== cron messages
NOTIFY_NOW = """
Саша @alwaysfeelsun, сегодня нужно сделать еженедельный пост в группе!
"""

NOTIFY_SOON = """
Саша @alwaysfeelsun, завтра нужно будет сделать еженедельный пост в группе!
"""

TEST_MESSAGE = """
Это тестовое сообщение. Привет тестировщикам!
"""
