DEFAULT_REPLY = """
Привет! Я - бот книжного клуба.
К сожалению, я ещё слишком маленький и нахожусь в разработке, поэтому не смогу тебе составить полноценную компанию.
Когда я буду готов, мои создатели обязательно оповестят тебя об этом сообщением в группе книжного клуба.
Кстати, в этой группе ты можешь делиться прочитанными книгами, выполнять задания и следить за откликами других участников.

Надеюсь, что мы скоро подружимся! Хорошего дня :)
"""

REPLY_WITH_NAME = """
Привет, %s! Я - бот книжного клуба.
К сожалению, я ещё слишком маленький и нахожусь в разработке, поэтому не смогу тебе составить полноценную компанию.
Когда я буду готов, мои создатели обязательно оповестят тебя об этом сообщением в группе книжного клуба.
Кстати, в этой группе ты можешь делиться прочитанными книгами, выполнять задания и следить за откликами других участников.

Надеюсь, что мы скоро подружимся! Хорошего дня :)
"""

NOTIFY_NOW = """
Саша @alwaysfeelsun, сегодня нужно сделать еженедельный пост в группе!
"""

NOTIFY_SOON = """
Саша @alwaysfeelsun, завтра нужно будет сделать еженедельный пост в группе!
"""

TEST_MESSAGE = """
Это тестовое сообщение. Привет тестировщикам!
"""

#================================================
USER_STATE_START = "start"
USER_STATE_MENU = "menu"
USER_STATE_WRITING_FEEDBACK = "writing_feedback"
USER_STATE_PREVIEW_PAGE = "preview_page"
USER_STATE_FEEDBACK_SELECTED = "feedback_selected"
USER_STATE_EDITING_FEEDBACK = "editing_feedback"

#================================================
CLUB_CHAT_ID = 1
TEST_CHAT_ID = 2
ADMIN_CHAT_ID = 3
