DEFAULT_REPLY = """
Привет! Я - бот книжного клуба.
К сожалению, я ещё слишком маленький и нахожусь в разработке, поэтому не смогу тебе составить полноценную компанию.
Когда я буду готов, мои создатели обязательно оповестят тебя об этом сообщением в группе книжного клуба.
Кстати, в этой группе ты можешь делиться прочитанными книгами, выполнять задания и следить за откликами других участников.

Надеюсь, что мы скоро подружимся! Хорошего дня :)
"""

NOTIFY_SOON = """
Саша @alwaysfeelsun, завтра нужно будет сделать еженедельный пост в группе!
"""

NOTIFY_NOW = """
Саша @alwaysfeelsun, сегодня нужно сделать еженедельный пост в группе!
"""

CLUB_CHAT_ID = 1
TEST_CHAT_ID = 2
ADMIN_CHAT_ID = 3
